# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого
# отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется больше
# суммы двух других, то треугольника с такими сторонами не существует. Отдельно сообщить
# является ли треугольник разносторонним, равнобедренным или равносторонним.

a = int(input('Введите отрезок a: '))
b = int(input('Введите отрезок b: '))
c = int(input('Введите отрезок c: '))

if (a + b > c) and (b + c > a) and (a + c > b):
    if (a == b) or (a == c) or (b == c):
        result = f'Треугольник со сторонами {a}, {b}, {c} равнобедренный'
    elif a == b == c:
        result = f'Треугольник со сторонами {a}, {b}, {c} равносторонний'
    else:
        result = f'Треугольник со сторонами {a}, {b}, {c} разносторонний'
else:
    result = f'Треугольника со сторонами {a}, {b}, {c} не существует'

print(result)