# Создайте словарь со списком вещей для похода в качестве ключа и их массой в качестве значения.
# Определите какие вещи влезут в рюкзак, передав его максимальную грузоподъёмность.
# Достаточно вернуть один допустимый вариант.
# *Верните все возможные варианты комплектации рюкзака.


hike = {'спички': 10, 'топор': 2000, 'компас': 350, 'фонарик': 460, 'палатка': 1300, 'котелок': 500, 'спальник': 700, 'гитара': 1000}
my_bag = int(input('Введите макс грузоподъемность рюксзака в граммах '))

possible_comb = []
for item, weight in hike.items():
    if weight <= my_bag:
        possible_comb.append(item)
        my_bag -= weight
print(possible_comb)
