# В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых.
# Не учитывать знаки препинания и регистр символов. За основу возьмите любую статью из
# википедии или из документации к языку.

text = ('Посадил дед репку. Выросла репка большая-пребольшая. Стал дед репку из земли тянуть: тянет-потянет, вытянуть не может.'
        'Позвал дед на помощь бабку. Бабка за дедку, дедка за репку - тянут-потянут, вытянуть не могут. '
        'Позвала бабка внучку. Внучка за бабку, бабка за дедку, дедка за репку - тянут-потянут, вытянуть не могут. '
        'Кликнула внучка Жучку. Жучка за внучку, внучка за бабку, бабка за дедку, дедка за репку - тянут-потянут, вытянуть не могут. '
        'Кликнула Жучка кошку. Кошка за Жучку, Жучка за внучку, внучка за бабку, бабка за дедку, дедка за репку - тянут-потянут, вытянуть не могут. '
        'Позвала кошка мышку. Мышка за кошку, кошка за Жучку, Жучка за внучку, внучка за бабку, бабка за дедку, дедка за репку - тянут-потянут, вытянули репку!').lower()

marks = '''!()-[]{};?@#$%:'"\,./^&amp;*_'''

for x in text:
    if x in marks:
        text = text.replace(x, "")

data = text.split()

my_dict = {}
for char in data:
    if char not in my_dict:
        my_dict[char] = 1
    else:
        my_dict[char] += 1

my_dict = sorted(my_dict.items(), key=lambda item: item[1], reverse=True)[:10]
print(my_dict)
