# Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины:
# имена str, ставка int, премия str с указанием процентов вида «10.25%».
# В результате получаем словарь с именем в качестве ключа и суммой
# премии в качестве значения. Сумма рассчитывается
# как ставка умноженная на процент премии

names = ['Tom', 'Jack', 'Alice']
salaries = [120, 130, 140]
bonuses = ['10.2%', '12.4$', '13.5%']
my_dict = {name: (salary * float(bonus[:-1])) for name in names for salary in salaries for bonus in bonuses}
print(my_dict)